{
	"links": [
		"https://www.linkedin.com/in/hairum-qureshi",
		"https://www.github.com/Hairum-Qureshi",
		"https://www.hairum-qureshi.dev"
	],
	"phoneNumber": "(302)-480-0559",
	"email": "hqureshi@udel.edu",
	"GPA": 3.0,
	"programmingLanguages": ["HTML", "CSS", "JavaScript", "TypeScript"],
	"skills": {
		"proficientIn": [
			"MongoDB",
			"Express.js",
			"React.js",
			"Node.js",
			"TailwindCSS",
			"TypeScript",
			"GitHub",
			"Vite",
			"HTML",
			"Visual Studio Code"
		],
		"workingKnowledgeOf": [
			"Python",
			"Redis",
			"Firebase",
			"Supabase",
			"Next.js",
			"Google Gemini"
		]
	},
	"workExperience": [
		{
			"jobTitle": "Teaching Assistant, University of Delaware",
			"college_department": "Computer & Information Sciences",
			"bullets": [
				"Provided individualized tutoring and support through weekly lab sessions and office hours.",
				"Graded assignments and provided detailed feedback to ensure fair evaluation practices.",
				"Assisted professors in classroom instruction and clarified coursework confusion.",
				"Implemented innovative teaching strategies to help students grasp challenging topics."
			],
			"workTimeline": "August 2023 to May 2025"
		},
		{
			"jobTitle": "TechDeck Support, University of Delaware",
			"college_department": "Lerner College of Business and Economics",
			"bullets": [
				"Provided technical support to students and faculty at the college's computer lab.",
				"Assisted users with troubleshooting software issues and application configurations.",
				"Delivered personalized assistance to enhance user proficiency with college software tools."
			],
			"workTimeline": "September 2023 to Present"
		}
	],
	"projects": [
		"Deployed a MERN full-stack note-posting website on Vercel.",
		"Served as a group leader for an introductory software engineering class project, utilizing React.js and OpenAI's ChatGPT API to create a unique job-searching quiz application.",
		"Collaborated with a group to develop and extend Sage, a widely used Discord bot within the UD computer science department, contributing new features and enhancements used by students and faculty."
	],
	"academicProjects": [
		"Leading a team of 5 to continue development of the Gemini AI Chatbot for the UD CIS Graduate Program, building on a previous cohort's project.",
		"Expanded the chatbot's knowledge base by curating and adding new Q&A pairs to the underlying JSON dataset, improving accuracy and coverage of graduate program queries.",
		"Collaborating with faculty stakeholders to test, refine, and deploy updates aligned with departmental communication needs.",
		"Integrated and configured the chatbot within the department's WordPress site by resolving setup issues, documenting implementation steps, and modifying HTML elements to ensure proper functionality."
	]
}
